In [2]:
import pandas as pd
students = pd.DataFrame(
    {
        'student_id' : [1,2,3,4], 
        'name' : ["shubham" , "sanket" , "rohan" , "rajat"], 
        'city' : ["pune" , "satara" , "pune" , "mumbai"]
    }
)
students

   student_id     name    city
0           1  shubham    pune
1           2   sanket  satara
2           3    rohan    pune
3           4    rajat  mumbai

In [3]:
marks = pd.DataFrame(
    {
        'student_id' : [1,2,3,5],
        'Maths' : [70,90,75,80],
        'Science' : [60,70,40,80]
    }
)
marks

   student_id  Maths  Science
0           1     70       60
1           2     90       70
2           3     75       40
3           5     80       80

In [4]:
ExtraStudent = pd.DataFrame(
    {
        'student_id' : [6,7], 
        'name' : ["swapnil" , "ghansham"], 
        'city' : ["solapur" , "piliv"]
    }
)
ExtraStudent

   student_id      name     city
0           6   swapnil  solapur
1           7  ghansham    piliv

In [5]:
data = pd.merge(students , marks , on="student_id")
data

   student_id     name    city  Maths  Science
0           1  shubham    pune     70       60
1           2   sanket  satara     90       70
2           3    rohan    pune     75       40

In [6]:
data = pd.merge(students , marks , on="student_id" , how="inner")
data

   student_id     name    city  Maths  Science
0           1  shubham    pune     70       60
1           2   sanket  satara     90       70
2           3    rohan    pune     75       40

In [7]:
data = pd.merge(students , marks , on="student_id" , how="left")
data

   student_id     name    city  Maths  Science
0           1  shubham    pune   70.0     60.0
1           2   sanket  satara   90.0     70.0
2           3    rohan    pune   75.0     40.0
3           4    rajat  mumbai    NaN      NaN

In [8]:
data = pd.merge(students , marks , on="student_id" , how="right")
data

   student_id     name    city  Maths  Science
0           1  shubham    pune     70       60
1           2   sanket  satara     90       70
2           3    rohan    pune     75       40
3           5      NaN     NaN     80       80

In [9]:
data = pd.merge(students , marks , on="student_id" , how="outer")
data

   student_id     name    city  Maths  Science
0           1  shubham    pune   70.0     60.0
1           2   sanket  satara   90.0     70.0
2           3    rohan    pune   75.0     40.0
3           4    rajat  mumbai    NaN      NaN
4           5      NaN     NaN   80.0     80.0

In [10]:
data = pd.concat([students , ExtraStudent] , ignore_index=True)
data

   student_id      name     city
0           1   shubham     pune
1           2    sanket   satara
2           3     rohan     pune
3           4     rajat   mumbai
4           6   swapnil  solapur
5           7  ghansham    piliv